In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/scientists.csv')

In [2]:
print(df)

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [3]:
df.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
print(df.shape)

(8, 5)

In [9]:
df = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/gapminder.tsv',sep='\t')

In [10]:
print(df)

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [11]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [12]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [13]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [17]:
print(df.shape) # 튜플
#행의 크기
print(df.shape[0])
#열의 크기
print(df.shape[1])
## 컬럼의 정보 확인
print(df.columns)
#### 컬럼의 타입 확인
print(df.dtypes)
#### 컬럼의 모든 정보 , 
### null이 있는지, 데이터의 갯수는 몇개인지, 자료형은 무엇인지
print(df.info())

(1704, 6)
1704
6
Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')
country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB
None

In [19]:
### 컬럼의 정보를 확인
print(df['country'])

print(type(df['country']))

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object
<class 'pandas.core.series.Series'>

In [20]:
print(df['country'].tail())

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [21]:
print(df['country'].head())

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [28]:
print(df[['country', 'continent',  'year']])

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [27]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [30]:
print(df.loc[0])

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [32]:
print(df.loc[100])

country      Bangladesh
continent          Asia
year               1972
lifeExp          45.252
pop            70759295
gdpPercap    630.233627
Name: 100, dtype: object

In [33]:
print(type(df.loc[100]))

<class 'pandas.core.series.Series'>

In [37]:
print(df.loc[1703]) # 명시적 index
print(df.iloc[-1]) # 암시적 index

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object
country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [39]:
print(df.shape)
number_of_rows = df.shape[0]
last_row_index = number_of_rows - 1
print(df.loc[last_row_index])

(1704, 6)
country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [40]:
print(df.tail())

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [41]:
print(df.tail(n=1))

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [42]:
print(df.tail(n=3))

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [43]:
print(df.tail(n=10))

       country continent  year  lifeExp       pop   gdpPercap
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [44]:
print(df.head(n=10))

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

In [ ]:
print(df[['country', 'continent',  'year']])

In [46]:
print(df.loc[[0,100, 1000]])

          country continent  year  lifeExp       pop    gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333   779.445314
100    Bangladesh      Asia  1972   45.252  70759295   630.233627
1000     Mongolia      Asia  1972   53.754   1320500  1421.741975

In [51]:
print(df.iloc[-1])
print(df.iloc[99])
print(df.iloc[1])

try:
    print(df.iloc[17003])
except:
    print("인덱스가 존재하지 않아요")

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object
country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object
country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object
인덱스가 존재하지 않아요

In [52]:
#print(df.loc[[0,100, 1000]]) #명시적 index
print(df.iloc[[0,100, 1000]]) # 암시적 index

          country continent  year  lifeExp       pop    gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333   779.445314
100    Bangladesh      Asia  1972   45.252  70759295   630.233627
1000     Mongolia      Asia  1972   53.754   1320500  1421.741975

In [54]:
## 0행에서 10행을 출력하시오
print(df.iloc[0:11 : ])

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055

In [57]:
### 전체 행에서 country 와 year 와 pop  
print(df[['country','year','pop']])
print(df.loc[:,['country','year','pop']])

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]
          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [59]:
# print(df.loc[:,['country','year','pop']].head())
subset = df.loc[:,['country','year','pop']]
print(subset.head())

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [62]:
print(df.iloc[:,[0,2,4]])
print(df.iloc[:,[0,2,4]].tail())
print(df.iloc[:,[0,2,4]].head())

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [71]:
## 모든 행에 대해서 0열 부터 5개의 열을 가져오시오
print(df.iloc[:,0:5])
print(df.iloc[:, range(5)])
## 5개의 행을 가져올 때 모든 열을 출력하시오.
print(df.iloc[0:5,:])
print(df.iloc[range(5), : ]) 

### 10번부터 5개의 행을 가져오시오.
print(df.iloc[range(10,15), :])
### 모든 행에 대해 3번 열부터 3개의 열을 가져오시오
print(df.iloc[:, range(3, 6)])

          country continent  year  lifeExp       pop
0     Afghanistan      Asia  1952   28.801   8425333
1     Afghanistan      Asia  1957   30.332   9240934
2     Afghanistan      Asia  1962   31.997  10267083
3     Afghanistan      Asia  1967   34.020  11537966
4     Afghanistan      Asia  1972   36.088  13079460
...           ...       ...   ...      ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418
1700     Zimbabwe    Africa  1992   60.377  10704340
1701     Zimbabwe    Africa  1997   46.809  11404948
1702     Zimbabwe    Africa  2002   39.989  11926563
1703     Zimbabwe    Africa  2007   43.487  12311143

[1704 rows x 5 columns]
          country continent  year  lifeExp       pop
0     Afghanistan      Asia  1952   28.801   8425333
1     Afghanistan      Asia  1957   30.332   9240934
2     Afghanistan      Asia  1962   31.997  10267083
3     Afghanistan      Asia  1967   34.020  11537966
4     Afghanistan      Asia  1972   36.088  13079460
...           ...       ...   ...      ...       ...
1699     Zimbabwe    Africa  1987   62.351   9216418
1700     Zimbabwe    Africa  1992   60.377  10704340
1701     Zimbabwe    Africa  1997   46.809  11404948
1702     Zimbabwe    Africa  2002   39.989  11926563
1703     Zimbabwe    Africa  2007   43.487  12311143

[1704 rows x 5 columns]
       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
        country continent  year  lifeExp       pop    gdpPercap
10  Afghanistan      Asia  2002   42.129  25268405   726.734055
11  Afghanistan      Asia  2007   43.828  31889923   974.580338
12      Albania    Europe  1952   55.230   1282697  1601.056136
13      Albania    Europe  1957   59.280   1476505  1942.284244
14      Albania    Europe  1962   64.820   1728137  2312.888958
      lifeExp       pop   gdpPercap
0      28.801   8425333  779.445314
1      30.332   9240934  820.853030
2      31.997  10267083  853.100710
3      34.020  11537966  836.197138
4      36.088  13079460  739.981106
...       ...       ...         ...
1699   62.351   9216418  706.157306
1700   60.377  10704340  693.420786
1701   46.809  11404948  792.449960
1702   39.989  11926563  672.038623
1703   43.487  12311143  469.709298

[1704 rows x 3 columns]

In [75]:
# 열을 0부터 5까지중 한칸씩 띄어서 가져오시오.
print(df.iloc[:, range(0, 6 ,2 )])
#행을 0부터 20개를 가져오고 열을 0부터 5까지 가져올 때 행과 열을 한카씩 띄어서
# 가져오시오.
print(df.iloc[range(0,20,2) ,range(0, 6,2)])

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]
        country  year       pop
0   Afghanistan  1952   8425333
2   Afghanistan  1962  10267083
4   Afghanistan  1972  13079460
6   Afghanistan  1982  12881816
8   Afghanistan  1992  16317921
10  Afghanistan  2002  25268405
12      Albania  1952   1282697
14      Albania  1962   1728137
16      Albania  1972   2263554
18      Albania  1982   2780097

In [76]:
print(df.iloc[:, :3]) #  모든 행에 0열부터 2열까지
print(df.iloc[:,0:6:2]) # 모든 행에 0열부터 5열까지 중 열을 한칸 씩
print(df.iloc[10:100:3,::2]) #10행부터 100의 행을 두칸씩 띄우고 
                             # 모든 열중에서 한칸씩 띄어서 출력

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]
          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]
        country  year       pop
10  Afghanistan  2002  25268405
13      Albania  1957   1476505
16      Albania  1972   2263554
19      Albania  1987   3075321
22      Albania  2002   3508512
25      Algeria  1957  10270856
28      Algeria  1972  14760787
31      Algeria  1987  23254956
34      Algeria  2002  31287142
37       Angola  1957   4561361
40       Angola  1972   5894858
43       Angola  1987   7874230
46       Angola  2002  10866106
49    Argentina  1957  19610538
52    Argentina  1972  24779799
55    Argentina  1987  31620918
58    Argentina  2002  38331121
61    Australia  1957   9712569
64    Australia  1972  13177000
67    Australia  1987  16257249
70    Australia  2002  19546792
73      Austria  1957   6965860
76      Austria  1972   7544201
79      Austria  1987   7578903
82      Austria  2002   8148312
85      Bahrain  1957    138655
88      Bahrain  1972    230800
91      Bahrain  1987    454612
94      Bahrain  2002    656397
97   Bangladesh  1957  51365468

In [79]:
### 0,99,999행과 0,3,5 열을 출력하시오.
print(df.iloc[[0,99,999],[0,3,5]])
# 열을 명시적 인덱스 사용
print(df.loc[[0,99,999],['country',  'lifeExp',    'gdpPercap']])

print(df.loc[10:13,['country',  'lifeExp',    'gdpPercap']])

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130
         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130
        country  lifeExp    gdpPercap
10  Afghanistan   42.129   726.734055
11  Afghanistan   43.828   974.580338
12      Albania   55.230  1601.056136
13      Albania   59.280  1942.284244

In [85]:
# 년도별 평균수명
print(df)
print(df.groupby('year')['lifeExp'].mean())
print(df.groupby('year')['lifeExp'].min())
print(df.groupby('year')['lifeExp'].max())

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]
year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64
year
1952    28.801
1957    30.332
1962    31.997
1967    34.020
1972    35.400
1977    31.220
1982    38.445
1987    39.906
1992    23.599
1997    36.087
2002    39.193
2007    39.613
Name: lifeExp, dtype: float64
year
1952    72.670
1957    73.470
1962    73.680
1967    74.160
1972    74.720
1977    76.110
1982    77.110
1987    78.670
1992    79.360
1997    80.690
2002    82.000
2007    82.603
Name: lifeExp, dtype: float64

In [86]:
grouped_year_df = df.groupby('year')
mean_lifeExp_by_year = grouped_year_df['lifeExp']
print(mean_lifeExp_by_year.mean())

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [87]:
print(df.groupby(['year','continent'])['lifeExp'].mean())

year  continent
1952  Africa       39.135500
      Americas     53.279840
      Asia         46.314394
      Europe       64.408500
      Oceania      69.255000
1957  Africa       41.266346
      Americas     55.960280
      Asia         49.318544
      Europe       66.703067
      Oceania      70.295000
1962  Africa       43.319442
      Americas     58.398760
      Asia         51.563223
      Europe       68.539233
      Oceania      71.085000
1967  Africa       45.334538
      Americas     60.410920
      Asia         54.663640
      Europe       69.737600
      Oceania      71.310000
1972  Africa       47.450942
      Americas     62.394920
      Asia         57.319269
      Europe       70.775033
      Oceania      71.910000
1977  Africa       49.580423
      Americas     64.391560
      Asia         59.610556
      Europe       71.937767
      Oceania      72.855000
1982  Africa       51.592865
      Americas     66.228840
      Asia         62.617939
      Europe       72.806400
      Oceania      74.290000
1987  Africa       53.344788
      Americas     68.090720
      Asia         64.851182
      Europe       73.642167
      Oceania      75.320000
1992  Africa       53.629577
      Americas     69.568360
      Asia         66.537212
      Europe       74.440100
      Oceania      76.945000
1997  Africa       53.598269
      Americas     71.150480
      Asia         68.020515
      Europe       75.505167
      Oceania      78.190000
2002  Africa       53.325231
      Americas     72.422040
      Asia         69.233879
      Europe       76.700600
      Oceania      79.740000
2007  Africa       54.806038
      Americas     73.608120
      Asia         70.728485
      Europe       77.648600
      Oceania      80.719500
Name: lifeExp, dtype: float64

In [88]:
print(df.groupby(['year','continent','gdpPercap'])['lifeExp'].mean())

year  continent  gdpPercap
1952  Africa     298.846212      42.138
                 299.850319      32.500
                 328.940557      35.928
                 339.296459      39.031
                 362.146280      34.078
                                  ...
2007  Europe     37506.419070    81.701
                 40675.996350    78.885
                 49357.190170    80.196
      Oceania    25185.009110    80.204
                 34435.367440    81.235
Name: lifeExp, Length: 1704, dtype: float64

In [89]:
print(df.groupby(['year','continent'])['lifeExp','gdpPercap'].mean())

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

<ipython-input-89-efb8ebc293c6>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  print(df.groupby(['year','continent'])['lifeExp','gdpPercap'].mean())

In [90]:
# 그룹화한 데이터의 개수 세기
print(df.groupby('continent')['country'].nunique())

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [92]:
#print(df.groupby('year')['lifeExp'].mean())
df.groupby('year')['lifeExp'].mean().plot()

In [95]:
s = pd.Series(['banana', 42], index=['a','b'])
### s = pd.Series({'a':'banan','b':42})
print(s)

a    banana
b        42
dtype: object

In [97]:
df = pd.DataFrame({
    'Name': ['이숭무', '이장범', '이상범'],
    'age':[30,18,17],
    'born':['1990-10-15','2005-05-27','2006-09-27']
})
df

  Name  age        born
0  이숭무   30  1990-10-15
1  이장범   18  2005-05-27
2  이상범   17  2006-09-27

In [99]:
df = pd.DataFrame({
    'Name': ['이숭무', '이장범', '이상범'],
    'age':[30,18,17],
    'born':['1990-10-15','2005-05-27','2006-09-27']
},index = ['a','b','c']
,columns=['Name','born','age']    
)
df

  Name        born  age
a  이숭무  1990-10-15   30
b  이장범  2005-05-27   18
c  이상범  2006-09-27   17

In [102]:
from collections import OrderedDict
df = pd.DataFrame(OrderedDict([
    ('Name' ,['이숭무', '이장범', '이상범']),
    ('age', [30,18,17]),
    ('born',['1990-10-15','2005-05-27','2006-09-27'])
]))
df

  Name  age        born
0  이숭무   30  1990-10-15
1  이장범   18  2005-05-27
2  이상범   17  2006-09-27

In [110]:
df = pd.DataFrame(
       data = {'Name' : ['이숭무', '이장범', '이상범'],
              'age': [30,18,17],
              'born' : ['1990-10-15','2005-05-27','2006-09-27']},
        index = {'a','b','c'},
         columns=['Name','born','age']
    )
df
print(df.values)

[['이숭무' '1990-10-15' 30]
 ['이장범' '2005-05-27' 18]
 ['이상범' '2006-09-27' 17]]

In [117]:
df
print(df.iloc[0])
print(df.loc['a'])
print(type(df.loc['a']))

Name           이숭무
born    1990-10-15
age             30
Name: a, dtype: object
Name           이숭무
born    1990-10-15
age             30
Name: a, dtype: object
<class 'pandas.core.series.Series'>

In [120]:
print(df.index)
print(df.keys()) # 컬럼 정보
print(df.loc['a'].index)

Index(['a', 'b', 'c'], dtype='object')
Index(['Name', 'born', 'age'], dtype='object')
Index(['Name', 'born', 'age'], dtype='object')

In [135]:
#df에서 나이만 출력
print(df['age'])
# print(df.loc['age']) #### 행이름이 age를 찾으시오
print(df.loc[:,'age']) 
### '이상범'의 나이를 출력하시오.
df
print(df.iloc[2,2])
print(df.loc['c','age'])

# 나이의 평균을 구하시오
print(df['age'].mean())
print(df['age'].min())
print(df['age'].max())
print(df['age'].std())

a    30
b    18
c    17
Name: age, dtype: int64
a    30
b    18
c    17
Name: age, dtype: int64
17
17
21.666666666666668
17
30
7.234178138070235

In [136]:
df = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [142]:
print(df['Age'])
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
59.125
90
37

In [144]:
#### 평균나이보다 많은 사람을 출력하시오.
print(df[df['Age'] > df['Age'].mean()])
### 평균나이보다 크면 True , 아니면 False
print(df['Age'] > df['Age'].mean())

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician
0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [146]:
print(df['Age'][[False,True,True,True,True,False,False,True]])

1    61
2    90
3    66
4    56
7    77
Name: Age, dtype: int64

In [147]:
s = pd.Series(range(9))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [148]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [152]:
print(type(df['Age']))
print(type(s))
print(df['Age'] + s)  # index가 같은 것끼리의 연산
print(df['Age'] + df['Age'])

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
0    37.0
1    62.0
2    92.0
3    69.0
4    60.0
5    50.0
6    47.0
7    84.0
8     NaN
dtype: float64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [154]:
print(df['Age'] + 20) # 브로드케스팅 
print(df['Age'] * 2)

0     57
1     81
2    110
3     86
4     76
5     65
6     61
7     97
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [156]:
s1 = pd.Series([1, 100])
s1
print(df['Age'] + s1)

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [160]:
rev_df = df['Age'].sort_index(ascending=False)
print(rev_df)
print(df['Age'])
print(df['Age'] + rev_df)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64
0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [164]:
print(df.loc[[0,1,3]])
print(df.loc[[True,True,False,True,False,False,False,False]])

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist
                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [165]:
print(df['Age'] * 2)
print(df * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

In [171]:
##### 몇살을 살았는지 구하시오. 'age_days_dt'으로 DataFrame에 추가하시오.
print(df.info())
### 문자타입의 날짜를 날짜 타입으로 변경
Born = pd.to_datetime(df['Born'],format='%Y-%m-%d')
Died = pd.to_datetime(df['Died'],format='%Y-%m-%d')
df['age_days_dt'] = Died -  Born 
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         8 non-null      object
 1   Born         8 non-null      object
 2   Died         8 non-null      object
 3   Age          8 non-null      int64
 4   Occupation   8 non-null      object
 5   age_days_dt  8 non-null      timedelta64[ns]
dtypes: int64(1), object(4), timedelta64[ns](1)
memory usage: 512.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         8 non-null      object
 1   Born         8 non-null      object
 2   Died         8 non-null      object
 3   Age          8 non-null      int64
 4   Occupation   8 non-null      object
 5   age_days_dt  8 non-null      timedelta64[ns]
dtypes: int64(1), object(4), timedelta64[ns](1)
memory usage: 512.0+ bytes
None

In [180]:
print(df)
# 데이터프레임의 데이터 섞기
import random
random.shuffle(df['Age'])
print(df)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   45             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   41             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   66           Biologist
5             John Snow  1813-03-15  1858-06-16   77           Physician
6           Alan Turing  1912-06-23  1954-06-07   56  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   37       Mathematician

  age_days_dt
0  13779 days
1  22404 days
2  32964 days
3  24345 days
4  20777 days
5  16529 days
6  15324 days
7  28422 days
                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   41             Chemist
1        William Gosset  1876-06-13  1937-10-16   66        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   77               Nurse
3           Marie Curie  1867-11-07  1934-07-04   45             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   61           Biologist
5             John Snow  1813-03-15  1858-06-16   90           Physician
6           Alan Turing  1912-06-23  1954-06-07   56  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   37       Mathematician

  age_days_dt
0  13779 days
1  22404 days
2  32964 days
3  24345 days
4  20777 days
5  16529 days
6  15324 days
7  28422 days

C:\Users\soldesk\.conda\envs\python503\lib\random.py:307: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

In [182]:
df_drop = df.drop(['Age'] , axis=1)
print(df_drop)

                   Name        Born        Died          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16             Chemist
1        William Gosset  1876-06-13  1937-10-16        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13               Nurse
3           Marie Curie  1867-11-07  1934-07-04             Chemist
4         Rachel Carson  1907-05-27  1964-04-14           Biologist
5             John Snow  1813-03-15  1858-06-16           Physician
6           Alan Turing  1912-06-23  1954-06-07  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23       Mathematician

  age_days_dt
0  13779 days
1  22404 days
2  32964 days
3  24345 days
4  20777 days
5  16529 days
6  15324 days
7  28422 days

In [184]:
print(df.columns)
print(df_drop.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'age_days_dt'], dtype='object')
Index(['Name', 'Born', 'Died', 'Occupation', 'age_days_dt'], dtype='object')

In [187]:
### DataFrame에 있는 데이터를 파일에 저장
df.to_csv('E:/df.csv')

In [188]:
df.to_csv('E:/df.tsv', sep="\t")

In [189]:
df.to_csv('E:/df1.csv' ,index=False)

In [195]:
import xlwt
df.to_excel('E:/df.xls')
import openpyxl
df.to_excel('E:/df.xlsx')

In [196]:
df.to_excel('E:/df1.xlsx',index=False)

In [204]:
df
df_drop = df.drop(['age_days_dt'], axis = 1) 
df_drop

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   41             Chemist
1        William Gosset  1876-06-13  1937-10-16   66        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   77               Nurse
3           Marie Curie  1867-11-07  1934-07-04   45             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   61           Biologist
5             John Snow  1813-03-15  1858-06-16   90           Physician
6           Alan Turing  1912-06-23  1954-06-07   56  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   37       Mathematician

In [207]:
df_drop = df.drop([1,3,5]) 
print(df_drop)
df_drop = df.drop([1,3,5], axis=0)
print(df_drop)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   41             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   77               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   61           Biologist
6           Alan Turing  1912-06-23  1954-06-07   56  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   37       Mathematician

  age_days_dt
0  13779 days
2  32964 days
4  20777 days
6  15324 days
7  28422 days
                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   41             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   77               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   61           Biologist
6           Alan Turing  1912-06-23  1954-06-07   56  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   37       Mathematician

  age_days_dt
0  13779 days
2  32964 days
4  20777 days
6  15324 days
7  28422 days

In [208]:
df1 = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/concat_1.csv')
df2 = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/concat_2.csv')
df3 = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/concat_3.csv')

In [209]:
print(df1)
print(df2)
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7
     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [210]:
row_concat = pd.concat([df1, df2, df3])
print(row_concat)

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [211]:
col_concat = pd.concat([df1, df2, df3], axis=1)
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [217]:
print(row_concat)
print(row_concat.loc[0])
print(row_concat.loc[1])
print(row_concat.iloc[5])

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11
    A   B   C   D
0  a0  b0  c0  d0
0  a4  b4  c4  d4
0  a8  b8  c8  d8
    A   B   C   D
1  a1  b1  c1  d1
1  a5  b5  c5  d5
1  a9  b9  c9  d9
A    a5
B    b5
C    c5
D    d5
Name: 1, dtype: object
a5

In [222]:
print(row_concat.iloc[5][0])
print(row_concat.iloc[5 , 0])
print(row_concat.iloc[5, ])

a5
a5
A    a5
B    b5
C    c5
D    d5
Name: 1, dtype: object

In [225]:
new_row_series = pd.Series(['n1', 'n2', 'n3', 'n4']) 
print(new_row_series)
print(df1)
### dataframe_series 합치기
dataframe_series = pd.concat([new_row_series,df1])
print(dataframe_series)

0    n1
1    n2
2    n3
3    n4
dtype: object
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
     0    A    B    C    D
0   n1  NaN  NaN  NaN  NaN
1   n2  NaN  NaN  NaN  NaN
2   n3  NaN  NaN  NaN  NaN
3   n4  NaN  NaN  NaN  NaN
0  NaN   a0   b0   c0   d0
1  NaN   a1   b1   c1   d1
2  NaN   a2   b2   c2   d2
3  NaN   a3   b3   c3   d3

In [226]:
dataframe_series1 = pd.concat([new_row_series,df1], axis = 1)
print(dataframe_series1)

    0   A   B   C   D
0  n1  a0  b0  c0  d0
1  n2  a1  b1  c1  d1
2  n3  a2  b2  c2  d2
3  n4  a3  b3  c3  d3

In [231]:
## 행 1개로 구성된 데이터프레임 생성
df4 = pd.DataFrame([['n1','n2','n3','n4']], columns=['A', 'B' ,  'C' ,  'D'])
print(df4)

    A   B   C   D
0  n1  n2  n3  n4

In [233]:
row_df = pd.concat([df1, new_row_series])
print(row_df)
row_df  = pd.concat([df1, df4])
print(row_df)

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

In [236]:
df4 = pd.DataFrame([['n1','n2','n3','n4']])
print(df4)
print(df1)
row_df = pd.concat([df1, df4])
print(row_df)

    0   1   2   3
0  n1  n2  n3  n4
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
     A    B    C    D    0    1    2    3
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   n1   n2   n3   n4

In [239]:
df4 = pd.DataFrame([['n1','n2','n3','n4']], columns=['A', 'B' ,  'C' ,  'D'])
print(df4)
print(df1)
df5 = df1 + df4
print(df5)

    A   B   C   D
0  n1  n2  n3  n4
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
      A     B     C     D
0  a0n1  b0n2  c0n3  d0n4
1   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN
3   NaN   NaN   NaN   NaN

In [245]:
print(df1)
print(df4)
row_df1 = pd.concat([df1,df4])
print(row_df1)
row_df1  = df1.append(df4)
print(row_df1)
row_df1 = df1.append(df4, ignore_index= True)
print(row_df1)
row_df2 = pd.concat([df1,df2,df3], ignore_index= True )
print(row_df2)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
    A   B   C   D
0  n1  n2  n3  n4
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4
      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [248]:
col_concat = pd.concat([df1, df2, df3], axis=1, ignore_index= True)
print(col_concat)

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [250]:
print(df1)
print(df2)
print(df3)
df2.columns = ['E','F','G','H']
df3.columns = ['A','C','F','H']
print(df1)
print(df2)
print(df3)
print(pd.concat([df1,df2,df3]))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7
     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7
     A    C    F    H
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11
     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7
0   a8  NaN   b8  NaN  NaN   c8  NaN   d8
1   a9  NaN   b9  NaN  NaN   c9  NaN   d9
2  a10  NaN  b10  NaN  NaN  c10  NaN  d10
3  a11  NaN  b11  NaN  NaN  c11  NaN  d11

In [254]:
# 열이 같은 것 만 붙이기
df4 = pd.concat([df1,df3]) 
print(df4)
same_df1_df3 = pd.concat([df1, df3], join ='inner' , ignore_index=True)
print(same_df1_df3)

     A    B    C    D    F    H
0   a0   b0   c0   d0  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN
0   a8  NaN   b8  NaN   c8   d8
1   a9  NaN   b9  NaN   c9   d9
2  a10  NaN  b10  NaN  c10  d10
3  a11  NaN  b11  NaN  c11  d11
     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
4   a8   b8
5   a9   b9
6  a10  b10
7  a11  b11

In [257]:
df4 = pd.concat([df2, df3])
print(df4)
same_df2_df3 = pd.concat([df2,df3],  join= 'inner' , ignore_index=True )
print(same_df2_df3)

     E    F    G    H    A    C
0   a4   b4   c4   d4  NaN  NaN
1   a5   b5   c5   d5  NaN  NaN
2   a6   b6   c6   d6  NaN  NaN
3   a7   b7   c7   d7  NaN  NaN
0  NaN   c8  NaN   d8   a8   b8
1  NaN   c9  NaN   d9   a9   b9
2  NaN  c10  NaN  d10  a10  b10
3  NaN  c11  NaN  d11  a11  b11
     F    H
0   b4   d4
1   b5   d5
2   b6   d6
3   b7   d7
4   c8   d8
5   c9   d9
6  c10  d10
7  c11  d11

In [260]:
df2.index = [4, 5, 6, 7] 
df3.index = [0, 2, 5, 7]
print(df2)
print(df3)
col_concat = pd.concat([df1,df3] ,axis= 1, join ='inner')
print(col_concat)

    E   F   G   H
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7
     A    C    F    H
0   a8   b8   c8   d8
2   a9   b9   c9   d9
5  a10  b10  c10  d10
7  a11  b11  c11  d11
    A   B   C   D   A   C   F   H
0  a0  b0  c0  d0  a8  b8  c8  d8
2  a2  b2  c2  d2  a9  b9  c9  d9

In [261]:
site = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/survey_site.csv')
visited = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/survey_visited.csv')

In [262]:
print(site)
print(visited)

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [264]:
site_visited = site.merge(visited,left_on='name',right_on='site')
print(site_visited)
#### where site.name= visit.site

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [266]:
person = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/survey_person.csv')
survey = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/survey_survey.csv')

In [267]:
print(person)
print(survey)

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth
    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [289]:
person_survey = person.merge(survey, left_on='ident', right_on='person', how='outer')
print(person_survey)
'''inner, outer, left, right'''

       ident   personal    family  taken person quant  reading
0       dyer    William      Dyer  619.0   dyer   rad     9.82
1       dyer    William      Dyer  619.0   dyer   sal     0.13
2       dyer    William      Dyer  622.0   dyer   rad     7.80
3       dyer    William      Dyer  622.0   dyer   sal     0.09
4         pb      Frank   Pabodie  734.0     pb   rad     8.41
5         pb      Frank   Pabodie  734.0     pb  temp   -21.50
6         pb      Frank   Pabodie  735.0     pb   rad     7.22
7         pb      Frank   Pabodie  751.0     pb   rad     4.35
8         pb      Frank   Pabodie  751.0     pb  temp   -18.50
9       lake   Anderson      Lake  734.0   lake   sal     0.05
10      lake   Anderson      Lake  751.0   lake   sal     0.10
11      lake   Anderson      Lake  752.0   lake   rad     2.19
12      lake   Anderson      Lake  752.0   lake   sal     0.09
13      lake   Anderson      Lake  752.0   lake  temp   -16.00
14      lake   Anderson      Lake  837.0   lake   rad     1.46
15      lake   Anderson      Lake  837.0   lake   sal     0.21
16       roe  Valentina   Roerich  752.0    roe   sal    41.60
17       roe  Valentina   Roerich  837.0    roe   sal    22.50
18       roe  Valentina   Roerich  844.0    roe   rad    11.25
19  danforth      Frank  Danforth    NaN    NaN   NaN      NaN
20       NaN        NaN       NaN  735.0    NaN   sal     0.06
21       NaN        NaN       NaN  735.0    NaN  temp   -26.00

In [271]:
print(visited)
print(survey)

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22
    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [272]:
visited_survey = visited.merge(survey , left_on='ident', right_on='taken')
print(visited_survey)

    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

In [273]:
print(person_survey)
print(visited_survey)

    taken person quant  reading ident   personal   family
0     619   dyer   rad     9.82  dyer    William     Dyer
1     619   dyer   sal     0.13  dyer    William     Dyer
2     622   dyer   rad     7.80  dyer    William     Dyer
3     622   dyer   sal     0.09  dyer    William     Dyer
4     734     pb   rad     8.41    pb      Frank  Pabodie
5     734     pb  temp   -21.50    pb      Frank  Pabodie
6     735     pb   rad     7.22    pb      Frank  Pabodie
7     751     pb   rad     4.35    pb      Frank  Pabodie
8     751     pb  temp   -18.50    pb      Frank  Pabodie
9     734   lake   sal     0.05  lake   Anderson     Lake
10    751   lake   sal     0.10  lake   Anderson     Lake
11    752   lake   rad     2.19  lake   Anderson     Lake
12    752   lake   sal     0.09  lake   Anderson     Lake
13    752   lake  temp   -16.00  lake   Anderson     Lake
14    837   lake   rad     1.46  lake   Anderson     Lake
15    837   lake   sal     0.21  lake   Anderson     Lake
16    752    roe   sal    41.60   roe  Valentina  Roerich
17    837    roe   sal    22.50   roe  Valentina  Roerich
18    844    roe   rad    11.25   roe  Valentina  Roerich
    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

In [275]:
ps_vs = person_survey.merge(visited_survey,left_on=['ident','taken','quant','reading'],
                           right_on=['person','ident','quant','reading'])
print(ps_vs)

    taken_x person_x quant  reading ident_x   personal   family  ident_y  \
0       619     dyer   rad     9.82    dyer    William     Dyer      619
1       619     dyer   sal     0.13    dyer    William     Dyer      619
2       622     dyer   rad     7.80    dyer    William     Dyer      622
3       622     dyer   sal     0.09    dyer    William     Dyer      622
4       734       pb   rad     8.41      pb      Frank  Pabodie      734
5       734       pb  temp   -21.50      pb      Frank  Pabodie      734
6       735       pb   rad     7.22      pb      Frank  Pabodie      735
7       751       pb   rad     4.35      pb      Frank  Pabodie      751
8       751       pb  temp   -18.50      pb      Frank  Pabodie      751
9       734     lake   sal     0.05    lake   Anderson     Lake      734
10      751     lake   sal     0.10    lake   Anderson     Lake      751
11      752     lake   rad     2.19    lake   Anderson     Lake      752
12      752     lake   sal     0.09    lake   Anderson     Lake      752
13      752     lake  temp   -16.00    lake   Anderson     Lake      752
14      837     lake   rad     1.46    lake   Anderson     Lake      837
15      837     lake   sal     0.21    lake   Anderson     Lake      837
16      752      roe   sal    41.60     roe  Valentina  Roerich      752
17      837      roe   sal    22.50     roe  Valentina  Roerich      837
18      844      roe   rad    11.25     roe  Valentina  Roerich      844

     site       dated  taken_y person_y
0    DR-1  1927-02-08      619     dyer
1    DR-1  1927-02-08      619     dyer
2    DR-1  1927-02-10      622     dyer
3    DR-1  1927-02-10      622     dyer
4    DR-3  1939-01-07      734       pb
5    DR-3  1939-01-07      734       pb
6    DR-3  1930-01-12      735       pb
7    DR-3  1930-02-26      751       pb
8    DR-3  1930-02-26      751       pb
9    DR-3  1939-01-07      734     lake
10   DR-3  1930-02-26      751     lake
11   DR-3         NaN      752     lake
12   DR-3         NaN      752     lake
13   DR-3         NaN      752     lake
14  MSK-4  1932-01-14      837     lake
15  MSK-4  1932-01-14      837     lake
16   DR-3         NaN      752      roe
17  MSK-4  1932-01-14      837      roe
18   DR-1  1932-03-22      844      roe

In [276]:
from numpy import NaN, NAN, nan
print(NaN == True)
print(NAN == True)
print(nan == True)

False
False
False

In [277]:
print(NaN == False)
print(NAN == False)
print(nan == False)

False
False
False

In [278]:
print(NaN == 0)
print(NaN == '')
print(NaN == None)

False
False
False

In [279]:
print(NaN == NaN)
'''
select * from employees where department_id is null
'''

False

In [281]:
print(pd.isnull(NAN))
print(pd.notnull(42))
print(pd.isnull(42))

True
True
False

In [286]:
#### 데이터 갯수
print(person_survey.count())
print(visited_survey.count())
print(visited_survey.shape)
print(visited_survey.shape[0] - visited_survey.count())

taken       19
person      19
quant       19
reading     19
ident       19
personal    19
family      19
dtype: int64
ident      21
site       21
dated      17
taken      21
person     19
quant      21
reading    21
dtype: int64
(21, 7)
ident      0
site       0
dated      4
taken      0
person     2
quant      0
reading    0
dtype: int64

In [290]:
num_legs = pd.Series({'goat': 4, 'amoeba': nan }) 
print(num_legs)

goat      4.0
amoeba    NaN
dtype: float64

In [295]:
df = pd.DataFrame({
    'Name': ['이숭무', '이장범', '이상범'],
    'age':[30,18,17],
    'born':['1990-10-15','2005-05-27','2006-09-27'],
    'missing':[NaN,NaN,NaN]
})
print(df)

  Name  age        born  missing
0  이숭무   30  1990-10-15      NaN
1  이장범   18  2005-05-27      NaN
2  이상범   17  2006-09-27      NaN

In [296]:
df = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/gapminder.tsv',sep='\t')

In [299]:
print(df.count())

country      1704
continent    1704
year         1704
lifeExp      1704
pop          1704
gdpPercap    1704
dtype: int64

In [308]:
#### 각년도별 평균수명은?
life_exp = df.groupby(['year'])['lifeExp'].mean()
print(life_exp)
life_exp = df.groupby(['year']).lifeExp.mean()
print(life_exp)
### 2002년도, 2007년도
print(type(life_exp))
print(life_exp[2002])
print(life_exp[2007])

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64
year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64
<class 'pandas.core.series.Series'>
65.69492253521126
67.00742253521126

In [313]:
#### 2000 년도 보다 이전 년도의 평균 수명을 출력하시오,
print(life_exp[life_exp.index < 2000])
#### 2000 년도 이후 년도의 평균 수명을 출력하시오,
print(life_exp[life_exp.index >= 2000])

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
Name: lifeExp, dtype: float64
year
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [314]:
ebola = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/country_timeseries.csv')

In [315]:
print(ebola)

           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289        2776.0            NaN            10030.0
1      1/4/2015  288        2775.0            NaN             9780.0
2      1/3/2015  287        2769.0         8166.0             9722.0
3      1/2/2015  286           NaN         8157.0                NaN
4    12/31/2014  284        2730.0         8115.0             9633.0
..          ...  ...           ...            ...                ...
117   3/27/2014    5         103.0            8.0                6.0
118   3/26/2014    4          86.0            NaN                NaN
119   3/25/2014    3          86.0            NaN                NaN
120   3/24/2014    2          86.0            NaN                NaN
121   3/22/2014    0          49.0            NaN                NaN

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0              NaN            NaN                 NaN          NaN
1              NaN            NaN                 NaN          NaN
2              NaN            NaN                 NaN          NaN
3              NaN            NaN                 NaN          NaN
4              NaN            NaN                 NaN          NaN
..             ...            ...                 ...          ...
117            NaN            NaN                 NaN          NaN
118            NaN            NaN                 NaN          NaN
119            NaN            NaN                 NaN          NaN
120            NaN            NaN                 NaN          NaN
121            NaN            NaN                 NaN          NaN

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           NaN         1786.0             NaN              2977.0
1           NaN         1781.0             NaN              2943.0
2           NaN         1767.0          3496.0              2915.0
3           NaN            NaN          3496.0                 NaN
4           NaN         1739.0          3471.0              2827.0
..          ...            ...             ...                 ...
117         NaN           66.0             6.0                 5.0
118         NaN           62.0             NaN                 NaN
119         NaN           60.0             NaN                 NaN
120         NaN           59.0             NaN                 NaN
121         NaN           29.0             NaN                 NaN

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0               NaN             NaN                  NaN           NaN
1               NaN             NaN                  NaN           NaN
2               NaN             NaN                  NaN           NaN
3               NaN             NaN                  NaN           NaN
4               NaN             NaN                  NaN           NaN
..              ...             ...                  ...           ...
117             NaN             NaN                  NaN           NaN
118             NaN             NaN                  NaN           NaN
119             NaN             NaN                  NaN           NaN
120             NaN             NaN                  NaN           NaN
121             NaN             NaN                  NaN           NaN

     Deaths_Mali
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
117          NaN
118          NaN
119          NaN
120          NaN
121          NaN

[122 rows x 18 columns]

In [316]:
### 누락 값에 갯수를 출력하시오
print(ebola.shape[0] - ebola.count())

Date                     0
Day                      0
Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

In [319]:
import numpy as np
# 총 누락값의 갯수는?
print(np.count_nonzero(ebola.isnull()))
# Cases_Guinea의 누락 갯수는?
print(np.count_nonzero(ebola['Cases_Guinea'].isnull()))

1214
29

In [323]:
#### 누락값이 있는 경우 특정 값으로 채우기
### fillna()라는 함수를 이용해서  누락값을 대체
print(ebola.iloc[0:10,0:5 ])
ebola_fillna = ebola.fillna(0)
print(ebola_fillna.iloc[0:10,0:5 ])

# 0~9행, 0열 4에만 누락값을 0으로 주자
ebola_fillna = ebola.fillna(0).iloc[0:10, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           NaN         8157.0                NaN
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0            NaN             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0            NaN             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0
         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            0.0            10030.0
1    1/4/2015  288        2775.0            0.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           0.0         8157.0                0.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0            0.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0            0.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

In [325]:
print(ebola_fillna)

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            0.0            10030.0
1    1/4/2015  288        2775.0            0.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           0.0         8157.0                0.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0            0.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0            0.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

In [327]:
print(ebola.mean())

Day                     144.778689
Cases_Guinea            911.064516
Cases_Liberia          2335.337349
Cases_SierraLeone      2427.367816
Cases_Nigeria            16.736842
Cases_Senegal             1.080000
Cases_UnitedStates        3.277778
Cases_Spain               1.000000
Cases_Mali                3.500000
Deaths_Guinea           563.239130
Deaths_Liberia         1101.209877
Deaths_SierraLeone      693.701149
Deaths_Nigeria            6.131579
Deaths_Senegal            0.000000
Deaths_UnitedStates       0.833333
Deaths_Spain              0.187500
Deaths_Mali               3.166667
dtype: float64

<ipython-input-327-1709f88f338f>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(ebola.mean())

In [328]:
ebola_fillna_mean = ebola.fillna(ebola.mean())
print(ebola_fillna_mean)

           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289   2776.000000    2335.337349       10030.000000
1      1/4/2015  288   2775.000000    2335.337349        9780.000000
2      1/3/2015  287   2769.000000    8166.000000        9722.000000
3      1/2/2015  286    911.064516    8157.000000        2427.367816
4    12/31/2014  284   2730.000000    8115.000000        9633.000000
..          ...  ...           ...            ...                ...
117   3/27/2014    5    103.000000       8.000000           6.000000
118   3/26/2014    4     86.000000    2335.337349        2427.367816
119   3/25/2014    3     86.000000    2335.337349        2427.367816
120   3/24/2014    2     86.000000    2335.337349        2427.367816
121   3/22/2014    0     49.000000    2335.337349        2427.367816

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0        16.736842           1.08            3.277778          1.0
1        16.736842           1.08            3.277778          1.0
2        16.736842           1.08            3.277778          1.0
3        16.736842           1.08            3.277778          1.0
4        16.736842           1.08            3.277778          1.0
..             ...            ...                 ...          ...
117      16.736842           1.08            3.277778          1.0
118      16.736842           1.08            3.277778          1.0
119      16.736842           1.08            3.277778          1.0
120      16.736842           1.08            3.277778          1.0
121      16.736842           1.08            3.277778          1.0

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           3.5     1786.00000     1101.209877         2977.000000
1           3.5     1781.00000     1101.209877         2943.000000
2           3.5     1767.00000     3496.000000         2915.000000
3           3.5      563.23913     3496.000000          693.701149
4           3.5     1739.00000     3471.000000         2827.000000
..          ...            ...             ...                 ...
117         3.5       66.00000        6.000000            5.000000
118         3.5       62.00000     1101.209877          693.701149
119         3.5       60.00000     1101.209877          693.701149
120         3.5       59.00000     1101.209877          693.701149
121         3.5       29.00000     1101.209877          693.701149

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0          6.131579             0.0             0.833333        0.1875
1          6.131579             0.0             0.833333        0.1875
2          6.131579             0.0             0.833333        0.1875
3          6.131579             0.0             0.833333        0.1875
4          6.131579             0.0             0.833333        0.1875
..              ...             ...                  ...           ...
117        6.131579             0.0             0.833333        0.1875
118        6.131579             0.0             0.833333        0.1875
119        6.131579             0.0             0.833333        0.1875
120        6.131579             0.0             0.833333        0.1875
121        6.131579             0.0             0.833333        0.1875

     Deaths_Mali
0       3.166667
1       3.166667
2       3.166667
3       3.166667
4       3.166667
..           ...
117     3.166667
118     3.166667
119     3.166667
120     3.166667
121     3.166667

[122 rows x 18 columns]

<ipython-input-328-6cb75a26a9e1>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  ebola_fillna_mean = ebola.fillna(ebola.mean())

In [331]:
#print(ebola)
#위 행에 있는 값으로 적용
ebola_ffill = ebola.fillna(method='ffill')
print(ebola_ffill)

           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289        2776.0            NaN            10030.0
1      1/4/2015  288        2775.0            NaN             9780.0
2      1/3/2015  287        2769.0         8166.0             9722.0
3      1/2/2015  286        2769.0         8157.0             9722.0
4    12/31/2014  284        2730.0         8115.0             9633.0
..          ...  ...           ...            ...                ...
117   3/27/2014    5         103.0            8.0                6.0
118   3/26/2014    4          86.0            8.0                6.0
119   3/25/2014    3          86.0            8.0                6.0
120   3/24/2014    2          86.0            8.0                6.0
121   3/22/2014    0          49.0            8.0                6.0

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0              NaN            NaN                 NaN          NaN
1              NaN            NaN                 NaN          NaN
2              NaN            NaN                 NaN          NaN
3              NaN            NaN                 NaN          NaN
4              NaN            NaN                 NaN          NaN
..             ...            ...                 ...          ...
117            0.0            1.0                 1.0          1.0
118            0.0            1.0                 1.0          1.0
119            0.0            1.0                 1.0          1.0
120            0.0            1.0                 1.0          1.0
121            0.0            1.0                 1.0          1.0

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           NaN         1786.0             NaN              2977.0
1           NaN         1781.0             NaN              2943.0
2           NaN         1767.0          3496.0              2915.0
3           NaN         1767.0          3496.0              2915.0
4           NaN         1739.0          3471.0              2827.0
..          ...            ...             ...                 ...
117         1.0           66.0             6.0                 5.0
118         1.0           62.0             6.0                 5.0
119         1.0           60.0             6.0                 5.0
120         1.0           59.0             6.0                 5.0
121         1.0           29.0             6.0                 5.0

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0               NaN             NaN                  NaN           NaN
1               NaN             NaN                  NaN           NaN
2               NaN             NaN                  NaN           NaN
3               NaN             NaN                  NaN           NaN
4               NaN             NaN                  NaN           NaN
..              ...             ...                  ...           ...
117             0.0             0.0                  0.0           1.0
118             0.0             0.0                  0.0           1.0
119             0.0             0.0                  0.0           1.0
120             0.0             0.0                  0.0           1.0
121             0.0             0.0                  0.0           1.0

     Deaths_Mali
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
117          1.0
118          1.0
119          1.0
120          1.0
121          1.0

[122 rows x 18 columns]

In [332]:
ebola_bfill = ebola.fillna(method='bfill')
print(ebola_bfill)

           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289        2776.0         8166.0            10030.0
1      1/4/2015  288        2775.0         8166.0             9780.0
2      1/3/2015  287        2769.0         8166.0             9722.0
3      1/2/2015  286        2730.0         8157.0             9633.0
4    12/31/2014  284        2730.0         8115.0             9633.0
..          ...  ...           ...            ...                ...
117   3/27/2014    5         103.0            8.0                6.0
118   3/26/2014    4          86.0            NaN                NaN
119   3/25/2014    3          86.0            NaN                NaN
120   3/24/2014    2          86.0            NaN                NaN
121   3/22/2014    0          49.0            NaN                NaN

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0             20.0            1.0                 4.0          1.0
1             20.0            1.0                 4.0          1.0
2             20.0            1.0                 4.0          1.0
3             20.0            1.0                 4.0          1.0
4             20.0            1.0                 4.0          1.0
..             ...            ...                 ...          ...
117            NaN            NaN                 NaN          NaN
118            NaN            NaN                 NaN          NaN
119            NaN            NaN                 NaN          NaN
120            NaN            NaN                 NaN          NaN
121            NaN            NaN                 NaN          NaN

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           7.0         1786.0          3496.0              2977.0
1           7.0         1781.0          3496.0              2943.0
2           7.0         1767.0          3496.0              2915.0
3           7.0         1739.0          3496.0              2827.0
4           7.0         1739.0          3471.0              2827.0
..          ...            ...             ...                 ...
117         NaN           66.0             6.0                 5.0
118         NaN           62.0             NaN                 NaN
119         NaN           60.0             NaN                 NaN
120         NaN           59.0             NaN                 NaN
121         NaN           29.0             NaN                 NaN

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0               8.0             0.0                  1.0           0.0
1               8.0             0.0                  1.0           0.0
2               8.0             0.0                  1.0           0.0
3               8.0             0.0                  1.0           0.0
4               8.0             0.0                  1.0           0.0
..              ...             ...                  ...           ...
117             NaN             NaN                  NaN           NaN
118             NaN             NaN                  NaN           NaN
119             NaN             NaN                  NaN           NaN
120             NaN             NaN                  NaN           NaN
121             NaN             NaN                  NaN           NaN

     Deaths_Mali
0            6.0
1            6.0
2            6.0
3            6.0
4            6.0
..           ...
117          NaN
118          NaN
119          NaN
120          NaN
121          NaN

[122 rows x 18 columns]

In [333]:
ebola_itpfill = ebola.interpolate()
print(ebola_itpfill)

           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289        2776.0            NaN            10030.0
1      1/4/2015  288        2775.0            NaN             9780.0
2      1/3/2015  287        2769.0         8166.0             9722.0
3      1/2/2015  286        2749.5         8157.0             9677.5
4    12/31/2014  284        2730.0         8115.0             9633.0
..          ...  ...           ...            ...                ...
117   3/27/2014    5         103.0            8.0                6.0
118   3/26/2014    4          86.0            8.0                6.0
119   3/25/2014    3          86.0            8.0                6.0
120   3/24/2014    2          86.0            8.0                6.0
121   3/22/2014    0          49.0            8.0                6.0

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0              NaN            NaN                 NaN          NaN
1              NaN            NaN                 NaN          NaN
2              NaN            NaN                 NaN          NaN
3              NaN            NaN                 NaN          NaN
4              NaN            NaN                 NaN          NaN
..             ...            ...                 ...          ...
117            0.0            1.0                 1.0          1.0
118            0.0            1.0                 1.0          1.0
119            0.0            1.0                 1.0          1.0
120            0.0            1.0                 1.0          1.0
121            0.0            1.0                 1.0          1.0

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           NaN         1786.0             NaN              2977.0
1           NaN         1781.0             NaN              2943.0
2           NaN         1767.0          3496.0              2915.0
3           NaN         1753.0          3496.0              2871.0
4           NaN         1739.0          3471.0              2827.0
..          ...            ...             ...                 ...
117         1.0           66.0             6.0                 5.0
118         1.0           62.0             6.0                 5.0
119         1.0           60.0             6.0                 5.0
120         1.0           59.0             6.0                 5.0
121         1.0           29.0             6.0                 5.0

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0               NaN             NaN                  NaN           NaN
1               NaN             NaN                  NaN           NaN
2               NaN             NaN                  NaN           NaN
3               NaN             NaN                  NaN           NaN
4               NaN             NaN                  NaN           NaN
..              ...             ...                  ...           ...
117             0.0             0.0                  0.0           1.0
118             0.0             0.0                  0.0           1.0
119             0.0             0.0                  0.0           1.0
120             0.0             0.0                  0.0           1.0
121             0.0             0.0                  0.0           1.0

     Deaths_Mali
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
117          1.0
118          1.0
119          1.0
120          1.0
121          1.0

[122 rows x 18 columns]

In [334]:
 # 누락값을 가진 행을 모두 삭제
ebola_drop = ebola.dropna()
print(ebola_drop)

          Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
19  11/18/2014  241        2047.0         7082.0             6190.0

    Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  Cases_Mali  \
19           20.0            1.0                 4.0          1.0         6.0

    Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  Deaths_Nigeria  \
19         1214.0          2963.0              1267.0             8.0

    Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  Deaths_Mali
19             0.0                  1.0           0.0          6.0

In [339]:
ebola['Cases_multiple'] = ebola['Cases_Guinea'] + ebola['Cases_Liberia'] + ebola['Cases_SierraLeone']

In [ ]:
print(ebola['Cases_multiple'])

In [350]:
print(ebola['Cases_Guinea'].sum())  #### 누락 값 무시
print(ebola['Cases_Guinea'].sum(skipna = True))
print(ebola.Cases_Guinea.sum(skipna = True))
print(ebola.sum())
print(ebola.sum(skipna = True))

84729.0
84729.0
84729.0
Date                   1/5/20151/4/20151/3/20151/2/201512/31/201412/2...
Day                                                                17663
Cases_Guinea                                                     84729.0
Cases_Liberia                                                   193833.0
Cases_SierraLeone                                               211181.0
Cases_Nigeria                                                      636.0
Cases_Senegal                                                       27.0
Cases_UnitedStates                                                  59.0
Cases_Spain                                                         16.0
Cases_Mali                                                          42.0
Deaths_Guinea                                                    51818.0
Deaths_Liberia                                                   89198.0
Deaths_SierraLeone                                               60352.0
Deaths_Nigeria                                                     233.0
Deaths_Senegal                                                       0.0
Deaths_UnitedStates                                                 15.0
Deaths_Spain                                                         3.0
Deaths_Mali                                                         38.0
Cases_multiple                                                  197682.0
dtype: object
Date                   1/5/20151/4/20151/3/20151/2/201512/31/201412/2...
Day                                                                17663
Cases_Guinea                                                     84729.0
Cases_Liberia                                                   193833.0
Cases_SierraLeone                                               211181.0
Cases_Nigeria                                                      636.0
Cases_Senegal                                                       27.0
Cases_UnitedStates                                                  59.0
Cases_Spain                                                         16.0
Cases_Mali                                                          42.0
Deaths_Guinea                                                    51818.0
Deaths_Liberia                                                   89198.0
Deaths_SierraLeone                                               60352.0
Deaths_Nigeria                                                     233.0
Deaths_Senegal                                                       0.0
Deaths_UnitedStates                                                 15.0
Deaths_Spain                                                         3.0
Deaths_Mali                                                         38.0
Cases_multiple                                                  197682.0
dtype: object

In [353]:
print(ebola['Cases_Guinea'].sum(skipna = False)) # 누락값도 포함
print(ebola.Cases_Guinea.sum(skipna = False))

nan
nan

In [354]:
print(ebola['Cases_Guinea'].fillna(0).sum(skipna = False)) # 누락값도 포함
print(ebola.Cases_Guinea.fillna(0).sum(skipna = False))

84729.0
84729.0

In [355]:
pew = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/pew.csv')

In [356]:
print(pew)

                   religion  <$10k  $10-20k  $20-30k  $30-40k  $40-50k  \
0                  Agnostic     27       34       60       81       76
1                   Atheist     12       27       37       52       35
2                  Buddhist     27       21       30       34       33
3                  Catholic    418      617      732      670      638
4        Don’t know/refused     15       14       15       11       10
5          Evangelical Prot    575      869     1064      982      881
6                     Hindu      1        9        7        9       11
7   Historically Black Prot    228      244      236      238      197
8         Jehovah's Witness     20       27       24       24       21
9                    Jewish     19       19       25       25       30
10            Mainline Prot    289      495      619      655      651
11                   Mormon     29       40       48       51       56
12                   Muslim      6        7        9       10        9
13                 Orthodox     13       17       23       32       32
14          Other Christian      9        7       11       13       13
15             Other Faiths     20       33       40       46       49
16    Other World Religions      5        2        3        4        2
17             Unaffiliated    217      299      374      365      341

    $50-75k  $75-100k  $100-150k  >150k  Don't know/refused
0       137       122        109     84                  96
1        70        73         59     74                  76
2        58        62         39     53                  54
3      1116       949        792    633                1489
4        35        21         17     18                 116
5      1486       949        723    414                1529
6        34        47         48     54                  37
7       223       131         81     78                 339
8        30        15         11      6                  37
9        95        69         87    151                 162
10     1107       939        753    634                1328
11      112        85         49     42                  69
12       23        16          8      6                  22
13       47        38         42     46                  73
14       14        18         14     12                  18
15       63        46         40     41                  71
16        7         3          4      4                   8
17      528       407        321    258                 597

In [357]:
print(pew.columns)

Index(['religion', '<$10k', '$10-20k', '$20-30k', '$30-40k', '$40-50k',
       '$50-75k', '$75-100k', '$100-150k', '>150k', 'Don't know/refused'],
      dtype='object')

In [361]:
# 행값이 열값으로 변경
pew_long = pd.melt(pew, id_vars='religion')
print(pew.iloc[0:10, 0:6])
print(pew_long.iloc[0:20,:])

                  religion  <$10k  $10-20k  $20-30k  $30-40k  $40-50k
0                 Agnostic     27       34       60       81       76
1                  Atheist     12       27       37       52       35
2                 Buddhist     27       21       30       34       33
3                 Catholic    418      617      732      670      638
4       Don’t know/refused     15       14       15       11       10
5         Evangelical Prot    575      869     1064      982      881
6                    Hindu      1        9        7        9       11
7  Historically Black Prot    228      244      236      238      197
8        Jehovah's Witness     20       27       24       24       21
9                   Jewish     19       19       25       25       30
                   religion variable  value
0                  Agnostic    <$10k     27
1                   Atheist    <$10k     12
2                  Buddhist    <$10k     27
3                  Catholic    <$10k    418
4        Don’t know/refused    <$10k     15
5          Evangelical Prot    <$10k    575
6                     Hindu    <$10k      1
7   Historically Black Prot    <$10k    228
8         Jehovah's Witness    <$10k     20
9                    Jewish    <$10k     19
10            Mainline Prot    <$10k    289
11                   Mormon    <$10k     29
12                   Muslim    <$10k      6
13                 Orthodox    <$10k     13
14          Other Christian    <$10k      9
15             Other Faiths    <$10k     20
16    Other World Religions    <$10k      5
17             Unaffiliated    <$10k    217
18                 Agnostic  $10-20k     34
19                  Atheist  $10-20k     27

In [363]:
pew_long = pd.melt(pew, id_vars='religion', var_name='income', value_name='count')
print(pew_long)

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [364]:
billboard = pd.read_csv('https://raw.githubusercontent.com/SoongMoo/soldesk202108/main/%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C/Pandas_pdf/data/billboard.csv')

In [366]:
print(billboard)
print(billboard.columns)

     year            artist                    track  time date.entered  wk1  \
0    2000             2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   87
1    2000           2Ge+her  The Hardest Part Of ...  3:15   2000-09-02   91
2    2000      3 Doors Down               Kryptonite  3:53   2000-04-08   81
3    2000      3 Doors Down                    Loser  4:24   2000-10-21   76
4    2000          504 Boyz            Wobble Wobble  3:35   2000-04-15   57
..    ...               ...                      ...   ...          ...  ...
312  2000       Yankee Grey     Another Nine Minutes  3:10   2000-04-29   86
313  2000  Yearwood, Trisha          Real Live Woman  3:55   2000-04-01   85
314  2000   Ying Yang Twins  Whistle While You Tw...  4:19   2000-03-18   95
315  2000     Zombie Nation            Kernkraft 400  3:30   2000-09-02   99
316  2000   matchbox twenty                     Bent  4:12   2000-04-29   60

      wk2   wk3   wk4   wk5  ...  wk67  wk68  wk69  wk70  wk71  wk72  wk73  \
0    82.0  72.0  77.0  87.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1    87.0  92.0   NaN   NaN  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2    70.0  68.0  67.0  66.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
3    76.0  72.0  69.0  67.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4    34.0  25.0  17.0  17.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
..    ...   ...   ...   ...  ...   ...   ...   ...   ...   ...   ...   ...
312  83.0  77.0  74.0  83.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
313  83.0  83.0  82.0  81.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
314  94.0  91.0  85.0  84.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
315  99.0   NaN   NaN   NaN  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN
316  37.0  29.0  24.0  22.0  ...   NaN   NaN   NaN   NaN   NaN   NaN   NaN

     wk74  wk75  wk76
0     NaN   NaN   NaN
1     NaN   NaN   NaN
2     NaN   NaN   NaN
3     NaN   NaN   NaN
4     NaN   NaN   NaN
..    ...   ...   ...
312   NaN   NaN   NaN
313   NaN   NaN   NaN
314   NaN   NaN   NaN
315   NaN   NaN   NaN
316   NaN   NaN   NaN

[317 rows x 81 columns]
Index(['year', 'artist', 'track', 'time', 'date.entered', 'wk1', 'wk2', 'wk3',
       'wk4', 'wk5', 'wk6', 'wk7', 'wk8', 'wk9', 'wk10', 'wk11', 'wk12',
       'wk13', 'wk14', 'wk15', 'wk16', 'wk17', 'wk18', 'wk19', 'wk20', 'wk21',
       'wk22', 'wk23', 'wk24', 'wk25', 'wk26', 'wk27', 'wk28', 'wk29', 'wk30',
       'wk31', 'wk32', 'wk33', 'wk34', 'wk35', 'wk36', 'wk37', 'wk38', 'wk39',
       'wk40', 'wk41', 'wk42', 'wk43', 'wk44', 'wk45', 'wk46', 'wk47', 'wk48',
       'wk49', 'wk50', 'wk51', 'wk52', 'wk53', 'wk54', 'wk55', 'wk56', 'wk57',
       'wk58', 'wk59', 'wk60', 'wk61', 'wk62', 'wk63', 'wk64', 'wk65', 'wk66',
       'wk67', 'wk68', 'wk69', 'wk70', 'wk71', 'wk72', 'wk73', 'wk74', 'wk75',
       'wk76'],
      dtype='object')

In [368]:
billboard_long = pd.melt(billboard, id_vars=['year', 'artist', 'track', 'time', 'date.entered'],
                        var_name='week' ,value_name='rating')
print(billboard_long.iloc[0:10,:])

   year          artist                    track  time date.entered week  \
0  2000           2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk1
1  2000         2Ge+her  The Hardest Part Of ...  3:15   2000-09-02  wk1
2  2000    3 Doors Down               Kryptonite  3:53   2000-04-08  wk1
3  2000    3 Doors Down                    Loser  4:24   2000-10-21  wk1
4  2000        504 Boyz            Wobble Wobble  3:35   2000-04-15  wk1
5  2000            98^0  Give Me Just One Nig...  3:24   2000-08-19  wk1
6  2000         A*Teens            Dancing Queen  3:44   2000-07-08  wk1
7  2000         Aaliyah            I Don't Wanna  4:15   2000-01-29  wk1
8  2000         Aaliyah                Try Again  4:03   2000-03-18  wk1
9  2000  Adams, Yolanda            Open My Heart  5:30   2000-08-26  wk1

   rating
0    87.0
1    91.0
2    81.0
3    76.0
4    57.0
5    51.0
6    97.0
7    84.0
8    59.0
9    76.0

In [370]:
#print(ebola)
ebola_long = pd.melt(ebola, id_vars=['Date',  'Day'])
print(ebola_long)

            Date  Day        variable   value
0       1/5/2015  289    Cases_Guinea  2776.0
1       1/4/2015  288    Cases_Guinea  2775.0
2       1/3/2015  287    Cases_Guinea  2769.0
3       1/2/2015  286    Cases_Guinea     NaN
4     12/31/2014  284    Cases_Guinea  2730.0
...          ...  ...             ...     ...
2069   3/27/2014    5  Cases_multiple   117.0
2070   3/26/2014    4  Cases_multiple     NaN
2071   3/25/2014    3  Cases_multiple     NaN
2072   3/24/2014    2  Cases_multiple     NaN
2073   3/22/2014    0  Cases_multiple     NaN

[2074 rows x 4 columns]

In [376]:
# 열 이름 분리하고 데이터프레임에 추가하기
variable_split = ebola_long.variable.str.split('_')
print(variable_split)
print(variable_split[0]) # 첫번째 행의 데이터
print(variable_split.str.get(0))
print(variable_split.str.get(1))

0         [Cases, Guinea]
1         [Cases, Guinea]
2         [Cases, Guinea]
3         [Cases, Guinea]
4         [Cases, Guinea]
              ...
2069    [Cases, multiple]
2070    [Cases, multiple]
2071    [Cases, multiple]
2072    [Cases, multiple]
2073    [Cases, multiple]
Name: variable, Length: 2074, dtype: object
['Cases', 'Guinea']
0       Cases
1       Cases
2       Cases
3       Cases
4       Cases
        ...
2069    Cases
2070    Cases
2071    Cases
2072    Cases
2073    Cases
Name: variable, Length: 2074, dtype: object
0         Guinea
1         Guinea
2         Guinea
3         Guinea
4         Guinea
          ...
2069    multiple
2070    multiple
2071    multiple
2072    multiple
2073    multiple
Name: variable, Length: 2074, dtype: object

In [377]:
print(ebola_long)

            Date  Day        variable   value
0       1/5/2015  289    Cases_Guinea  2776.0
1       1/4/2015  288    Cases_Guinea  2775.0
2       1/3/2015  287    Cases_Guinea  2769.0
3       1/2/2015  286    Cases_Guinea     NaN
4     12/31/2014  284    Cases_Guinea  2730.0
...          ...  ...             ...     ...
2069   3/27/2014    5  Cases_multiple   117.0
2070   3/26/2014    4  Cases_multiple     NaN
2071   3/25/2014    3  Cases_multiple     NaN
2072   3/24/2014    2  Cases_multiple     NaN
2073   3/22/2014    0  Cases_multiple     NaN

[2074 rows x 4 columns]

In [378]:
ebola_long['status'] = variable_split.str.get(0)
ebola_long['country'] = variable_split.str.get(1)

In [379]:
print(ebola_long)

            Date  Day        variable   value status   country
0       1/5/2015  289    Cases_Guinea  2776.0  Cases    Guinea
1       1/4/2015  288    Cases_Guinea  2775.0  Cases    Guinea
2       1/3/2015  287    Cases_Guinea  2769.0  Cases    Guinea
3       1/2/2015  286    Cases_Guinea     NaN  Cases    Guinea
4     12/31/2014  284    Cases_Guinea  2730.0  Cases    Guinea
...          ...  ...             ...     ...    ...       ...
2069   3/27/2014    5  Cases_multiple   117.0  Cases  multiple
2070   3/26/2014    4  Cases_multiple     NaN  Cases  multiple
2071   3/25/2014    3  Cases_multiple     NaN  Cases  multiple
2072   3/24/2014    2  Cases_multiple     NaN  Cases  multiple
2073   3/22/2014    0  Cases_multiple     NaN  Cases  multiple

[2074 rows x 6 columns]

In [380]:
print(ebola_long[ebola_long['status']=='Cases'])

            Date  Day        variable   value status   country
0       1/5/2015  289    Cases_Guinea  2776.0  Cases    Guinea
1       1/4/2015  288    Cases_Guinea  2775.0  Cases    Guinea
2       1/3/2015  287    Cases_Guinea  2769.0  Cases    Guinea
3       1/2/2015  286    Cases_Guinea     NaN  Cases    Guinea
4     12/31/2014  284    Cases_Guinea  2730.0  Cases    Guinea
...          ...  ...             ...     ...    ...       ...
2069   3/27/2014    5  Cases_multiple   117.0  Cases  multiple
2070   3/26/2014    4  Cases_multiple     NaN  Cases  multiple
2071   3/25/2014    3  Cases_multiple     NaN  Cases  multiple
2072   3/24/2014    2  Cases_multiple     NaN  Cases  multiple
2073   3/22/2014    0  Cases_multiple     NaN  Cases  multiple

[1098 rows x 6 columns]

In [382]:
print(ebola.columns)
ebola_drop = ebola.dropna(subset=['Cases_Guinea'])
print(ebola_drop)

Index(['Date', 'Day', 'Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone',
       'Cases_Nigeria', 'Cases_Senegal', 'Cases_UnitedStates', 'Cases_Spain',
       'Cases_Mali', 'Deaths_Guinea', 'Deaths_Liberia', 'Deaths_SierraLeone',
       'Deaths_Nigeria', 'Deaths_Senegal', 'Deaths_UnitedStates',
       'Deaths_Spain', 'Deaths_Mali', 'Cases_multiple'],
      dtype='object')
           Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0      1/5/2015  289        2776.0            NaN            10030.0
1      1/4/2015  288        2775.0            NaN             9780.0
2      1/3/2015  287        2769.0         8166.0             9722.0
4    12/31/2014  284        2730.0         8115.0             9633.0
5    12/28/2014  281        2706.0         8018.0             9446.0
..          ...  ...           ...            ...                ...
117   3/27/2014    5         103.0            8.0                6.0
118   3/26/2014    4          86.0            NaN                NaN
119   3/25/2014    3          86.0            NaN                NaN
120   3/24/2014    2          86.0            NaN                NaN
121   3/22/2014    0          49.0            NaN                NaN

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
0              NaN            NaN                 NaN          NaN
1              NaN            NaN                 NaN          NaN
2              NaN            NaN                 NaN          NaN
4              NaN            NaN                 NaN          NaN
5              NaN            NaN                 NaN          NaN
..             ...            ...                 ...          ...
117            NaN            NaN                 NaN          NaN
118            NaN            NaN                 NaN          NaN
119            NaN            NaN                 NaN          NaN
120            NaN            NaN                 NaN          NaN
121            NaN            NaN                 NaN          NaN

     Cases_Mali  Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  \
0           NaN         1786.0             NaN              2977.0
1           NaN         1781.0             NaN              2943.0
2           NaN         1767.0          3496.0              2915.0
4           NaN         1739.0          3471.0              2827.0
5           NaN         1708.0          3423.0              2758.0
..          ...            ...             ...                 ...
117         NaN           66.0             6.0                 5.0
118         NaN           62.0             NaN                 NaN
119         NaN           60.0             NaN                 NaN
120         NaN           59.0             NaN                 NaN
121         NaN           29.0             NaN                 NaN

     Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  \
0               NaN             NaN                  NaN           NaN
1               NaN             NaN                  NaN           NaN
2               NaN             NaN                  NaN           NaN
4               NaN             NaN                  NaN           NaN
5               NaN             NaN                  NaN           NaN
..              ...             ...                  ...           ...
117             NaN             NaN                  NaN           NaN
118             NaN             NaN                  NaN           NaN
119             NaN             NaN                  NaN           NaN
120             NaN             NaN                  NaN           NaN
121             NaN             NaN                  NaN           NaN

     Deaths_Mali  Cases_multiple
0            NaN             NaN
1            NaN             NaN
2            NaN         20657.0
4            NaN         20478.0
5            NaN         20170.0
..           ...             ...
117          NaN           117.0
118          NaN             NaN
119          NaN             NaN
120          NaN             NaN
121          NaN             NaN

[93 rows x 19 columns]